//=====================================================================//
//		アニメーション用タイマー [animation.h]                         //
//                                                                     //
//                                               GP51A247 SoSei        //
//                                               2018/07/05            //
//---------------------------------------------------------------------//
//                                                                     //
//=====================================================================//
#ifndef ANIMATION_H_
#define ANIMATION_H_
#include <Windows.h>

/**************************************************

			タイマー用enum

**************************************************/
typedef enum TimerCode
{
	TC_ERROR = 0,		 // タイマー初期
	TC_TIMER01,			 // タイマー 1
	TC_TIMER02,			 // タイマー 2
	TC_TIMER03,			 // タイマー 3
	TC_TIMER04,			 // タイマー 4
	TC_TIMER05,			 // タイマー 5
	TC_END
}TimerCode;

/**************************************************

プロトタイプ宣言

**************************************************/
/* --------------------------------
タイマー初期化関数
-------------------------------- */
bool OnSetTimer(HWND hWnd, TimerCode Code, UINT Time, TIMERPROC lpTimerFunc);
/* --------------------------------
タイマー終了処理
-------------------------------- */
void DestoryTimer(HWND hWnd, TimerCode Code);

#endif // !ANIMATION_H_