//=====================================================================//
//		アニメーション用タイマー [animation.cpp]                       //
//                                                                     //
//                                               GP51A247 SoSei        //
//                                               2018/07/05            //
//---------------------------------------------------------------------//
//                                                                     //
//=====================================================================//
#include "animation.h"

//=====================================================================//
//                                                                     //
//                           アニメーションチェック				       //
//                                                                     //
//=====================================================================//
bool OnSetTimer(HWND hWnd, TimerCode Code, UINT Time, TIMERPROC lpTimerFunc)
{
	/* --------------------------------
	1時変数宣言
	-------------------------------- */
	UINT TCode = TC_ERROR;

	/* --------------------------------
	タイマーが指定数と違ったらエラー
	指定のタイマーだったらセット
	-------------------------------- */
	TCode = Code;
	if ((TCode == TC_ERROR) || (TCode == TC_END))
	{
		MessageBox(hWnd, "セットタイマーエラー", "TimerError", MB_OK);
		return FALSE;
	}
	SetTimer(hWnd, TCode, Time, lpTimerFunc);
	return TRUE;
}

//=====================================================================//
//                                                                     //
//                           アニメーションリリース				       //
//                                                                     //
//=====================================================================//
void DestoryTimer(HWND hWnd, TimerCode Code)
{
	/* --------------------------------
	1時変数宣言
	-------------------------------- */
	UINT TCode = TC_ERROR;
	/* --------------------------------
	違ったタイマーが指定したらエラー
	あってたらリリース
	-------------------------------- */
	TCode = Code;
	if ((TCode == TC_ERROR) || (TCode == TC_END))
	{
		MessageBox(hWnd, "タイマー削除エラー", "TimerError", MB_OK);
		return;
	}
	KillTimer(hWnd, TCode);
}