//=============================================================================
//
// バックグラウンドクラス [background.cpp]
//										Autor:ロ
//										Date:2018/09/30
//=============================================================================

//*****************************************************************************
// インクルードファイル
//*****************************************************************************
#include "background.h"
#include "Texture.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define BACKGROUND_POS_X	(1600.0f)
#define BACKGROUND_POS_Y	(450.0f)

//*****************************************************************************
// コンストラクタ
//*****************************************************************************
Background::Background()
{
	//位置の設定
	pos.p.x = BACKGROUND_POS_X;
	pos.p.y = BACKGROUND_POS_Y;

	//サイズの設定
	pos.hl.x = TextrueGetWidth(k_tutorialMap)/2;
	pos.hl.y = TextrueGetHeight(k_tutorialMap)/2;

	//初期化
	//（XY座標,長さ,高さ）を設定
	Sprite3D::SetPos(D3DXVECTOR2(pos.p.x, pos.p.y), pos.hl.x, pos.hl.y);
	// 画像分割数
	Sprite3D::SetDivide(1, 1);		
	// 現在UV座標設定
	Sprite3D::SetUVNum(0, 0);									
}

//*****************************************************************************
// デストラクタ
//*****************************************************************************
Background::~Background()
{

}

//*****************************************************************************
// 描画
//*****************************************************************************
void Background::Draw()
{
	//描画
	LPDIRECT3DDEVICE9 pDevice = DirectX3DGetDevice();

	Sprite3D::Draw(pDevice, DirectX3DGetTEXTURE(k_tutorialMap));

}