//=====================================================================//
//		ブロック２ループ用処理 [BlockTwoLoop.h]                        //
//                                                                     //
//                                               GP52A275 SoSei        //
//                                               2018/10/28            //
//---------------------------------------------------------------------//
//   2018/10/28　                                                      //
//   メインループ用													   //
//   2018/10/28　                                                      //
//   Sprite3Dを継承、角度計算の描画を入れた							   //
//   2018/11/01　                                                      //
//   ブロック２の空気壁と絵の判定を入れた							   //
//   プレイヤーマネージャーにSTOP　Xを入れ                             //
//   プレイヤーCLASSにX停止するための関数を入れ                        //
//   2018/11/04　                                                      //
//   スイッチを入れ、プレイヤー１が2階にいる時の調整				   //
//                                                                     //
//                                                                     //
//=====================================================================//
#ifndef BLOCKTWOLOOP_H_
#define BLOCKTWOLOOP_H_


/**************************************************

プロトタイプ宣言

**************************************************/
/* --------------------------------
ブロック２の初期処理
-------------------------------- */
void BlockTwoLoopInit(void);
/* --------------------------------
ブロック２の終了処理
-------------------------------- */
void BlockTwoLoopUnit(void);
/* --------------------------------
ブロック２の描画処理
-------------------------------- */
void BlockTwoLoopDraw(void);
/* --------------------------------
ブロック２の更新処理
-------------------------------- */
void BlockTwoLoopUpdate(void);
/* --------------------------------
アクション行使、
絵を正しくするためのキーチェック
-------------------------------- */
void BlockTwoSwitch(void);
#endif // !BLOCKTWOLOOP_H_
