#include "cameraManager.h"
#include "camera.h"

static Camera *camera;

//*****************************************************************************
// カメラの初期処理
//*****************************************************************************
void CameraManager_Initialize(void) {
	camera = new Camera();
}

//*****************************************************************************
// カメラの終了処理
//*****************************************************************************
void CameraManager_Finalize(void) {
	if (camera) { delete camera; camera = NULL; }
}

//*****************************************************************************
// カメラの更新処理
//*****************************************************************************
void CameraManager_Update(D3DXVECTOR2 player1_vec, D3DXVECTOR2 player2_vec) {
	camera->Update(player1_vec, player2_vec);
}

//*****************************************************************************
// カメラの設定更新
//*****************************************************************************
void CameraManager_Draw(void) {
	camera->SetTransform();
}

//*****************************************************************************
// ゲットカメラのビュー範囲
//*****************************************************************************
RECT GetCaneraRange(void) {
	return camera->GetViewRange();
}