//=====================================================================//
//		ブロック２オブジェクラス [CBlockTwoObj.h]                      //
//                                                                     //
//                                               GP52A275 SoSei        //
//                                               2018/10/28            //
//---------------------------------------------------------------------//
//   2018/10/28　                                                      //
//   Sprite3Dを継承、角度計算の描画を入れた							   //
//   2018/11/01　                                                      //
//   ブロック２の空気壁と絵の判定を入れた							   //
//   プレイヤーマネージャーにSTOP　Xを入れ                             //
//   プレイヤーCLASSにX停止するための関数を入れ                        //
//   2018/11/04　                                                      //
//   スイッチを入れ、プレイヤー１が2階にいる時の調整				   //
//                                                                     //
//                                                                     //
//=====================================================================//
#ifndef CBLOCKTWOOBJ_H_
#define CBLOCKTWOOBJ_H_

#include "Sprite3D.h"


/**************************************************

プロトタイプ宣言

**************************************************/
/* --------------------------------
ブロック２オブジェの初期処理
-------------------------------- */
void BlockTwoObjInit(void);
/* --------------------------------
ブロック２オブジェの終了処理
-------------------------------- */
void BlockTwoObjUnit(void);
/* --------------------------------
ブロック２オブジェの描画処理
-------------------------------- */
void BlockTwoObjDraw(void);
/* --------------------------------
ブロック２オブジェの更新処理
-------------------------------- */
void BlockTwoObjUpdate(bool bIsRotateUp);
/* --------------------------------
ブロック２通過可能か
-------------------------------- */
bool TrueIsBlockTwoObjOver(void);

/* --------------------------------
ゲットブロック２絵の中心位置
-------------------------------- */
S_3DVec GetBlockTwoPaintPos(void);

/**************************************************

前本宣言
ENUM宣言

**************************************************/
class Sprite3D;
typedef enum
{
	E_PAINT,
	E_BRIDGE,
}E_BlockTwoObj;

/**************************************************

ブロック２のオブジェクラス

**************************************************/
class CBlockTwoObj : public Sprite3D
{
private:
	E_BlockTwoObj E_ObjType;
public:
	CBlockTwoObj(E_BlockTwoObj);
	~CBlockTwoObj();
};



#endif // !CBLOCKTWOOBJ_H_
