/*====================================================================================

	オブジェクト管理クラス　 [CObjectMng.h]
																Autor	: 西口
																Date	: 2018/10/19
--------------------------------------------------------------------------------------
コメント:
--------------------------------------------------------------------------------------
修正日時:
====================================================================================*/


#ifndef COBJECTMNG_H
#define COBJECTMNG_H
/*--------------------------------------------------------------------------------------
	インクルードファイル
--------------------------------------------------------------------------------------*/
#include <list>
/*--------------------------------------------------------------------------------------
	列挙型 : 構造体
--------------------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------------------
	マクロ定義
--------------------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------------------
	クラス宣言
--------------------------------------------------------------------------------------*/

/*-------------------------------------------
	オブジェクト管理クラス
-------------------------------------------*/
class CObjectRegister;
class CObjectMng
{

private:

	//オブジェクト管理リスト
	std::list<CObjectRegister*> m_pObjectList;

public:

	//登録関数
	void Regist(CObjectRegister* pObject) { m_pObjectList.push_back(pObject); }

	//アップデート
	void Update();

	//描画
	void Draw();

};


/*-------------------------------------------
	オブジェクト登録クラス
-------------------------------------------*/
class CObjectRegister
{

private:

	//ポインター : オブジェクト管理クラス
	static CObjectMng* m_pObjectMng;

public:

	//コンストラクタ : デフォルト
	CObjectRegister();

	//デストラクタ : オーバーライド用
	virtual ~CObjectRegister() {}

	//アップデート
	virtual bool Update(void) = 0;

	//描画
	virtual void Draw(void) = 0;

	//セット : オブジェクト管理クラスポインター
	static void SetObjectMng(CObjectMng* ptr) { m_pObjectMng = ptr; }

};

#endif //_H
