#ifndef COLLISION_H_
#define COLLISION_H_


/**************************************************

プロトタイプ宣言

**************************************************/
/* --------------------------------
当たり判定の初期処理
-------------------------------- */
void CollisionInit(void);
/* --------------------------------
当たり判定の終了処理
-------------------------------- */
void CollisionUnit(void);
/* --------------------------------
当たり判定の描画処理
-------------------------------- */
void CollisionDraw(void);
/* --------------------------------
当たり判定の更新処理
-------------------------------- */
void CollisionUpdate(void);

#endif // !COLLISION_H_
