#include "Collision.h"

/* --------------------------------
当たり判定の初期処理
-------------------------------- */
void CollisionInit(void)
{

}
/* --------------------------------
当たり判定の終了処理
-------------------------------- */
void CollisionUnit(void)
{

}
/* --------------------------------
当たり判定の描画処理
-------------------------------- */
void CollisionDraw(void)
{

}
/* --------------------------------
当たり判定の更新処理
-------------------------------- */
void CollisionUpdate(void)
{
	/* --------------------------------
	計算用変数
	-------------------------------- */
	float xTemp, yTemp;
	float xSpriteTemp, ySpriteTemp;
	/* --------------------------------
	プレイヤーと判定物の
	中心点距離
	-------------------------------- */
	//xTemp = fabsf(P.pos.x - Obj.pos.x);
	//yTemp = fabsf(P.pos.y - Obj.pos.y);
	/* --------------------------------
	プレイヤーと判定物の
	ポリゴン範囲計算
	-------------------------------- */
	//xSpriteTemp = fabsf(P.width / 2 + Obj.width / 2);
	//ySpriteTemp = fabsf(P.height / 2 + Obj.height / 2);
	/* --------------------------------
	当たり判定
	-------------------------------- */
	if (xTemp <= xSpriteTemp && yTemp <= ySpriteTemp)
	{

	}
}