//=====================================================================//
//		ゲーム更新処理 [gameStage.h]                                   //
//                                                                     //
//                                               GP51A247 SoSei        //
//                                               2018/07/08            //
//---------------------------------------------------------------------//
//                                                                     //
//=====================================================================//
#ifndef GAMESTAGE_H_
#define GAMESTAGE_H_

/**************************************************

		進行ステージチェック用enum

**************************************************/
typedef enum k_GAME_STAGE_tag
{
	k_GAME_INDEX = 0,					// インデックス
	k_NEXT_STAGE,						// 加算用
	k_GAME_INIT,						// ゲームの初期化
	k_GAME_TITLE,						// ゲームのタイトル
	k_GAME_FADEIN,						// FADE IN
	k_GAME_TUTORIAL,					// ゲームのタイトル
	k_GAME_START,						// ゲームの進行
	k_GAME_FADEOUT,						// FADE OUT
	k_GAME_RESULT,						// ゲームのリザルト
	k_GAME_OVER,						// ゲームオーバー
	k_GAME_MAX,							// インデックスマックス
}k_GAME_STAGE;

/**************************************************

プロトタイプ宣言

**************************************************/
/* --------------------------------
ゲームの初期処理
-------------------------------- */
void GameInit(void);
/* --------------------------------
ゲームの終了処理
-------------------------------- */
void GameUnit(void);
/* --------------------------------
ゲームの描画処理
-------------------------------- */
void GameDraw(void);
/* --------------------------------
ゲームの更新処理
-------------------------------- */
void GameUpdate(void);
/* --------------------------------
スタートキー押したら、次ステージ
-------------------------------- */
void SetStartKey(void);
/* --------------------------------
ゲームオーバーの処理
-------------------------------- */
bool GameOverCheck(void);


void SetPlayerMove(bool bIs);
void SetPlayerJump(void);
#endif // !GAMESTAGE_H_

