//=====================================================================//
//		タイトル [Title.cpp]										   //
//                                                                     //
//                                               SoSei				   //
//                                               2018/10/06            //
//---------------------------------------------------------------------//
//                                                                     //
//=====================================================================//
#include "Title.h"
#include "Texture.h"
#include "Config.h"
#include "GameStage.h"

//=====================================================================//
//                                                                     //
//                       グローバル変数宣言						       //
//                                                                     //
//=====================================================================//
CTitle* g_pTitle = NULL;

/* --------------------------------
タイトルの初期処理
-------------------------------- */
void TitleInit(void)
{
	g_pTitle = new CTitle;
}
/* --------------------------------
タイトルの終了処理
-------------------------------- */
void TitleUnit(void)
{
	PTR_DELETE(g_pTitle);
}
/* --------------------------------
タイトルの描画処理
-------------------------------- */
void TitleDraw(void)
{
	g_pTitle->CDraw();
}
/* --------------------------------
タイトルの更新処理
-------------------------------- */
void TitleUpdate(void)
{

}

//******************************   タイトル用クラス設定   ******************************//
CTitle::CTitle()
{
	//初期化
	SetPos(D3DXVECTOR2(800.0f, 450.0f), 800, 450);
	SetDivide(1, 1);
	SetUVNum(0, 0);
	m_pDevice = DirectX3DGetDevice();
	m_pTex = DirectX3DGetTEXTURE(k_title);
}
CTitle::~CTitle()
{
	m_pTex->Release();
	m_pTex = NULL;
	m_pDevice = NULL;
}
void CTitle::CDraw(void)
{
	Draw(m_pDevice, m_pTex);
}