//=====================================================================//
//		チュートリアル [TutorialMap.h]								   //
//                                                                     //
//                                               SoSei				   //
//                                               2018/10/06            //
//---------------------------------------------------------------------//
//                                                                     //
//=====================================================================//
#ifndef TUTORIALMAP_H_
#define TUTORIALMAP_H_

#include "Sprite.h"


/**************************************************

プロトタイプ宣言

**************************************************/
/* --------------------------------
チュートリアルの初期処理
-------------------------------- */
void TutorialInit(void);
/* --------------------------------
チュートリアルの終了処理
-------------------------------- */
void TutorialUnit(void);
/* --------------------------------
チュートリアルの描画処理
-------------------------------- */
void TutorialDraw(void);
/* --------------------------------
チュートリアルの更新処理
-------------------------------- */
void TutorialUpdate(void);
/* --------------------------------
クリア可能
-------------------------------- */
bool TutorialClear(void);

/**************************************************

チュートリアルマップ用

**************************************************/
class Sprite;
class CTutorialMap : public Sprite
{
private:
	LPDIRECT3DDEVICE9 m_pDevice;
	IDirect3DTexture9 *m_pTex;
public:
	CTutorialMap();
	~CTutorialMap();

	void CDraw(void);
};



#endif // !TUTORIALMAP_H_