//=============================================================================
//
// プレイヤーの生命力UIクラス [UI_PlayerLife.h]
//										Autor:ロ
//										Date:2018/10/18
//=============================================================================

#ifndef UI_PLAYERLIFE_H
#define UI_PLAYERLIFE_H

//*****************************************************************************
// インクルードファイル
//*****************************************************************************
#include "Sprite.h"
#include "primitive2D.h"

//*****************************************************************************
// プレイヤーの生命力UIクラス
//*****************************************************************************
class UI_PlayerLife : public Sprite {
private:
	RectC2D pos;
	int LifeHeight;
public:
	UI_PlayerLife();
	~UI_PlayerLife();

	void Update();
	void Draw();
};

#endif